1сУчетОборудования/Documents/ПоступлениеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураОборудования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГарантияДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1сУчетОборудования/AccumulationRegisters/ОстаткиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиОборудования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1сУчетОборудования/Enums/СтатусОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1сУчетОборудования/Catalogs/ИнвентарныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИнвентарныеОбъекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияГарантии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1сУчетОборудования/Documents/ПоступлениеОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// Записываем движения
	Движения.ОстаткиОборудования.Записывать = Истина;

	Если Оборудование.Количество() = 0 Тогда
		Отказ = Истина;
		Сообщить("Документ не содержит оборудования!");
		Возврат;
	КонецЕсли;


	Для Каждого Строка Из Оборудование Цикл

		// --- 1. Проверки ---
		Если Строка.Номенклатура = Неопределено Тогда
			Отказ = Истина;
			Сообщить("Не заполнена номенклатура в строке №" + Строка.НомерСтроки);
			Возврат;
		КонецЕсли;

		Если ПустаяСтрока(Строка.ИнвентарныйНомер) Тогда
			Отказ = Истина;
			Сообщить("Не заполнен инвентарный номер в строке №" + Строка.НомерСтроки);
			Возврат;
		КонецЕсли;

		Если Строка.Стоимость < 0 Тогда
			Отказ = Истина;
			Сообщить("Стоимость не может быть отрицательной!");
			Возврат;
		КонецЕсли;


		// --- 2. Проверка дублей инвентарного номера ---
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|   ИнвентарныеОбъекты.Ссылка
		|ИЗ
		|   Справочник.ИнвентарныеОбъекты КАК ИнвентарныеОбъекты
		|ГДЕ
		|   ИнвентарныеОбъекты.ИнвентарныйНомер = &Номер";

		Запрос.УстановитьПараметр("Номер", Строка.ИнвентарныйНомер);

		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Отказ = Истина;
			Сообщить("Инвентарный номер уже существует: " + Строка.ИнвентарныйНомер);
			Возврат;
		КонецЕсли;


		// --- 3. Создание инвентарного объекта ---
		Попытка

			НовыйОбъект = Справочники.ИнвентарныеОбъекты.СоздатьЭлемент();

			НовыйОбъект.Номенклатура = Строка.Номенклатура;
			НовыйОбъект.ИнвентарныйНомер = Строка.ИнвентарныйНомер;
			НовыйОбъект.СерийныйНомер = Строка.СерийныйНомер;
			НовыйОбъект.ДатаПоступления = Дата;
			НовыйОбъект.Стоимость = Строка.Стоимость;
			НовыйОбъект.ДатаОкончанияГарантии = Строка.ГарантияДо;
			НовыйОбъект.Статус = Перечисления.СтатусОборудования.НаСкладе;

			// Наименование
			НовыйОбъект.Наименование =
				Строка.Номенклатура.Наименование
				+ " №" + Строка.ИнвентарныйНомер;

			НовыйОбъект.Записать();

		Исключение
			Отказ = Истина;
			Сообщить("Ошибка создания инвентарного объекта!");
			Возврат;
		КонецПопытки;


		// --- 4. Движение регистра ---
		Движение = Движения.ОстаткиОборудования.Добавить();

		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ИнвентарныйОбъект = НовыйОбъект.Ссылка;
		Движение.Номенклатура = Строка.Номенклатура;
		Движение.Подразделение = Подразделение;
		Движение.Сотрудник = Неопределено;
		Движение.Количество = 1;

	КонецЦикла;
КонецПроцедуры
